#%% Лабораторная работа №3
"""
Задача - сформировать сигналы и выполнить их фильтрацию.
Дополнить код реализациями полосового и заградительного фильтров.
Рекомендуется использовать ctrl+enter и shift+enter 
для испольнения кода по ячейкам в интерактивном режиме.

Содержание:
- Демонстрация растекания спектра
- Формирование сигнала
- Фильтрация сигнала в частотной области (идеальный фильтр)
- Фильтрация с БИХ фильтром
- Получение характеристик фильтра (ИХ, АЧХ, ФЧХ)

"""
#%% Инициализация
""" Инициализация
"""
import numpy as np
import math
from numpy.fft import fft, ifft, rfft, irfft

from toolbox import generate_single_chip, DFT
from plotit import plotit_pyplot as pt
from plotit import run_animation

from matplotlib import pyplot as plt
from scipy import signal as dsp
plt.switch_backend('Qt5Agg')
plt.ion()

lg, exp = np.log10, np.exp


#%% Демонстрация растекания спектра
""" Демонстрация растекания спектра

Блок демонстрирует растекание спектра и его причины.
Задаётся множество частот, которые соответствуют целы и
дробным отсчётам цифрового спектра.
Демонстрируется как сам сигнал, так и предполагаемый разрыв фазы
при периодическом повторении сигнала. В этом же окне демонстрируется 
изменение спектра связанное с разрывом фазы на границах.
Далее в динамике продемонстрировано изменение спектра при изменении частоты.
"""
f_d = 1e9			# частота дискретизации, Гц
t_d = 1/f_d			# период дискретизации
n_samples = 200							# число отсчётов в сигнале
use_window = True	# использовать окно?

t_ax = np.arange(n_samples)*t_d			# ось времени
f_ax = np.fft.rfftfreq(n_samples,t_d)	# ось частоты
ks = (10+np.arange(500)/100)	# частотные отсчёты для синусойд
f0s=f_d /n_samples * ks				 	# частоты синусойд, Гц
n2W = (f_d * n_samples)					# коэффициент нормировки СПМ (|БПФ|²)

# Creating a window
fig = plt.figure(f'Растекание спектра ({"с окном" if use_window else "Без окна"})')
fig.clf()
axs = fig.subplots(2,2)

# Демонстрация 
for i in range(5):
	f0=f0s[i*25]							# выбор каждой n-ой частоты
	
	x =  np.cos(2*np.pi*f0*t_ax)					# генерация сигнала
	if use_window: 	x *= np.hamming(x.shape[-1])	# домножить на окно

	X = np.abs(rfft(x))**2 / n2W

	pt(x=t_ax*1e9, y=x+2*i, 
		names=[f'{ks[i*25]}/N'],
		y_lims=[-2,12], x_label='Время, нс', 
		title='Сигнал', ax=axs[0,0])
	pt(x=(t_ax-t_ax[50])[:100]*1e9, y=np.roll(x, 50)[:100]+2*i, 
		names=[f'{ks[i*25]}/N'],
		y_lims=[-2,12], x_label='Время, нс', 
		title='Граница периодического сигнала', ax=axs[0,1])
	pt(x=f_ax/1e6, y=X, names=[f'{ks[i*25]}/N'], 
		x_label='Частота, МГц', y_label='СПМ, Вт/Гц', x_lims=[0,120], 
		title='ДПФ сигнала (дискретный спектр)', ax=axs[1,0])
	pt(x=f_ax/1e6, y=10*np.log(X), names=[f'{ks[i*25]}/N'], 
		x_label='Частота, МГц', y_label='СПМ, дБВт/Гц', x_lims=[0,120], 
		title='ДПФ сигнала (дискретный спектр)', ax=axs[1,1])


#%% Анимация растекания спектра 
""" Анимация растекания спектра """
Y=[]				# контейнер для спектра
for f0 in f0s:
	x = np.cos(2*np.pi*f0*t_ax)				# генерация сигнала
	y = np.abs(DFT(x, window=use_window))**2 / n2W 	# вычислить спектр и нормировать его
	Y.append(y)		# сохранить для анимации

fig = plt.figure('Изменеие частоты')
fig.clf()
run_animation(Y, f_ax/1e6, titles=[f'Частота синусойды (в отсчётах): {k:05.2f} / {n_samples}' for k in ks],
				x_label='Частота, МГц', fps=24, ax=fig)


#%% Анализ сигналов
""" Анализ сигналов
Задачи:
- Сформировать сигнал по варианту
- Проанализировать спектр сигнала
"""
f_d = 0.5e9			# частота дискретизации, Гц
t_d = 1/f_d			# период дискретизации
t_win = 4000e-9		# длительность рассматриваемого интервала
t_ch = 8e-9			# длительность импульса (t chirp)
f_car = 140e6		# частота несущей, Гц
f_mod = 5e6
i_mod = 0.5			# параметры модуляции (частота)


n_samples = t_win/t_d
if not n_samples.is_integer():
	print(f"t_win ({t_win}) должно делиться на t_d. Сейчас: {n_samples}. Округление.")
	n_samples = int(np.round(n_samples))
	t_win = t_d * n_samples
if n_samples % 2:	print('Нечетное число отсчётов усложняет спектр.')

s_v = generate_single_chip('video', t_d, t_win, t_ch)				# в/импульс
s_r = generate_single_chip('radio', t_d, t_win, t_ch, f_car)		# р/импульс
s_am = generate_single_chip('AM', t_d, t_win, f_car, f_mod, i_mod)	# АМ сигнал

signal = np.roll(s_am, math.floor(len(s_r)/2))	# выбрать сигнал для отображения
psd = np.abs(fft(signal))**2	# СПМ

# Отображение данных
t_ax = np.arange(n_samples)*t_d						# ось времени
f_ax_2 = np.arange(-n_samples/2, n_samples/2)/(t_d*n_samples)	# ось частот для двухстороннего спектра

fig = plt.figure('Анализ сигнала')
fig.clf()
axs = fig.subplots(2,1)
pt(x=t_ax*1e6, y=signal, x_label='Время, мкс', title='Сигнал', ax=axs[0])
pt(x=f_ax_2/1e6, y=2*psd, x_label='Частота, МГц', title='СПМ', ax=axs[1])


#%% Анализ фильтров
""" Анализ фильтров
1) 	Выбполнить фильтрацию идеальным фильтром
	по спектру сигнала по варианту определить частоты среза
	внутри ideal_filter используя функцию fft сформировать спектр и 
		обнулить отсчёты согласно заданию
	преобразовать обратнос в сигнал

NB!	Соответствие между отсчётами и частотами отражено в методических указаниях 
	на рисунке "Частотная сетка БПФ".
"""

def ideal_filter(x, ):
	X = fft(x,axis=-1)
	pt(x=f_ax_2, y=np.abs(X)**2,  names=['До фильтра'], title='СПМ', ax=plt.figure('Сигналы в идеальном фильтре'))
	Y = X 	#TODO Удалить отсчёты в соответствии с заданием
	y = ifft(Y,axis=-1)
	pt(x=f_ax_2, y=np.abs(X)**2,  names=['После фильтра'], title='СПМ', ax=plt.figure('Сигналы в идеальном фильтре'))
	if np.max(y.imag)>1e-14:
		raise ValueError("Результат комплексный, хотя исходный сигнал действительный. Проверьте свой код.")
	else: 
		return x.real


plt.figure('Сигналы в идеальном фильтре').clf()
signal_out_ideal = ideal_filter(signal)


#%% Применние БИХ фильтров
""" Применние БИХ фильтров
Дан пример применения ф. Баттерворта
Повторить для фильтра Чебышева
Вывести на одном графике
	Сигнал на входе и сигналы на выходе всех фильтров
	СПМ сигнала на входе и сигналов на выходе всех фильтров
"""
but_order = 3
cheb_order = 5 				# порядок фильтров
s_band_attenuation_db = 20	# внеполосное ослабление лепестков для фильтра Чебышева

f_cut_norm = 100e6/(f_d/2)
# Создание фильтра
b, a = dsp.butter(but_order, f_cut_norm, btype='low')
# Применение фильтра
signal_out_btr = dsp.filtfilt(b, a, signal)

# Сравнение результатов применения фильтров к сигналу по варианту


#%% Получение характеристик фильтров
""" Получение характеристик фильтров
- Построить ИХ фильтров на одном графике (показать отсчёты до 0)
- Построить АЧХ фильтровб на одном графике
- Построить ФЧХ фильтровб на одном графике
"""
def delta(N: int, m: int = 0):
	"""
	Генерирует дискретный δ-импульс (единичный импульс)	
	Parameters:
	N : int
	    Длина выходного массива
	m : int
	    Позиция единичного импульса (0 <= m < N)	
	Returns:
	numpy.ndarray
	    Массив длины N с единицей на позиции m и нулями в остальных позициях
	"""
	d = np.zeros((N,))
	d[int(m)] = 1
	return d


test_signal = delta(2000)
ir = ideal_filter(test_signal)
pt(ir, names=['ИХ идеального фильтра'])


# %%
